module.exports.config = {
  name: "قاعدة_المجموعة",
  version: "1.0.1", 
  hasPermssion: 1,
  credits: "kensu", //don't change the credits please
  description: "قواعد المجموعة التي يجب أن تطبق",
  commandCategory: "المجموعة",
  usePrefix:true,
  dependencies: 
  {
    "request":"",
    "fs-extra":"",
    "axios":""
  }
};
module.exports.run = async function({ api,event,args,client,Users,Threads,__GLOBAL,Currencies }) {
const axios = global.nodemodule["axios"];
const request = global.nodemodule["request"];
const fs = global.nodemodule["fs-extra"];
var link = ["𝗁𝗍𝗍𝗉𝗌://𝗂.𝗂𝗆𝗀𝗎𝗋.𝖼𝗈𝗆/𝗓𝖢2𝖣𝗋𝖭𝖡.𝗃𝗉𝖾𝗀","𝗁𝗍𝗍𝗉𝗌://𝗂.𝗂𝗆𝗀𝗎𝗋.𝖼𝗈𝗆/𝖵𝗒𝗓𝖯𝖳𝖻𝗂.𝗃𝗉𝖾𝗀","𝗁𝗍𝗍𝗉𝗌://𝗂.𝗂𝗆𝗀𝗎𝗋.𝖼𝗈𝗆/𝖬𝗓5𝖮𝖬𝖦𝖺.𝗃𝗉𝖾𝗀","𝗁𝗍𝗍𝗉𝗌://𝗂.𝗂𝗆𝗀𝗎𝗋.𝖼𝗈𝗆/𝖰𝗀𝖷𝖭𝗄𝖫𝖫.𝗃𝗉𝖾𝗀"];
var callback = () => api.sendMessage({body:`

\t\t💮قواعد وشروط الجروب💮\n
1-احترام آراء الآخرين وعدم التلفظ بألفاظ تخدش الحياء\n
2- الحفاظ على القيم والعادات والتقاليد\n
3- الحفاظ على تعاليم الدين الاسلامي\n
4- المرجو التعامل مع المنشورات الجديه بكل حزم وجد والمنشورات الاخرى
يتعامل فيها كل عضو بمايريد مع العلم ان التعليق يعبر عن شخصيتك\n
5 - عدم وضع صور إباحية ومثيرة جدا وذلك تفاديا لإثارة المشاكل من قبل بعض
الأعضاء
6- عدم إزعاج البنات بطلبات الأضافة داخل الجروب أو الرسائل غير
اللائقة.....يتم تنبيه العضو لمره واحده واذا لم يستجب العضو المعني يحذف
على الفور\n
7- عدم نشر اي صفحه او جروب فيNever Back Down\n
تنبيه العضو لمره واحده واذا لم يستجب العضو المعني يحذف على الفور
8- التشهير والتشويه لعضو ما او إنسان ما ؟ داخل الجروب يمنع منعا باتا
ويتحمل صاحب الموضوع الجزاء وهوا الحذف النهائي\n
9- يرجى عدم نشر المنشورات السياسية لكافة الدول العربية و اى عضو سينشر اى
منشور سياسى سيتم تحذيره مرة واحدة و بعد ذلك سيتم طرد العضو\n
10- أرجو الابلاغ فوراً عن أي شيء مخالف داخل الجروب
11- ممنوع نشر الصور الشخصيه على الجروب او كتابه ارقام الهواتف الخاصه بكم\n
11_السياسه ممنوعه منعا باتا ..................... وبكرر منمنوع السياسه
منعا باتا\n
12_ اى شاب يحاول الدخول باسم بنت مصيره #الطرد
.......اي شخص يسيء للجروب سيتم حظره
...... ? فأتمنى أن نبقى اخوة ? .....
لن نجبر أحداً على دخول المجموعة ولا على البقاء فيها !!!
ولكني ألتمس من الموجودين فيها إحترام قوانينها.
المجموعه منكم ولكم وانتم من يتصرف بمجريات الامور وكلنا تقة فيكم
ارجوا من الجميع الالتزام ولكم خالص الشكر والتقدير على التعاون\nمع خالص الشكر :\n\t\t
 💐مشرفين المجموعة💐
  .`,attachment: fs.createReadStream(__dirname + "/cache/ken.jpg")}, event.threadID, () => fs.unlinkSync(__dirname + "/cache/ken.jpg")); 
      return request(encodeURI(link[Math.floor(Math.random() * link.length)])).pipe(fs.createWriteStream(__dirname+"/cache/ken.jpg")).on("close",() => callback());
   };