module.exports.config = {
  name: "جرأة",
  version: "1.0.0",
  hasPermssion: 0,
  credits: "Peds aka Scott",
  description: "هي لعبة تحدي عن طريق الأسئلة",
  commandCategory: "لعبة",
  cooldowns: 1
};

module.exports.run = async ({ api, event, args, Users,__GLOBAL,Currencies }) => {

  const axios = require("axios");

  const fs = require("fs-extra");

  const request = require("request");
   const nameUser = (await Users.getData(event.senderID)).name || (await Users.getInfo(envent.senderID)).name;
  let data = (await Currencies.getData(event.senderID)).ghepTime;
  var emoji = [" قم بكسر بيضتين على رأسك.","أرسل أجمل صورة لك على هاتفك.","كل الموز بشكل مغر.","اذهب للخارج وأكل ورقة.","إذهب إلى الخارج قم بإلتقاط صورة و أرسلها هنا في المجموعة ","كم عدد الأشخاص الذين قبلتهم؟"," سبق لك أن أرسلت لشخص صورتك الشخصية ؟","هل سبق لك أن تلقيت صورًا / مقاطع فيديو عارية؟","ما هو لون ونوع الملابس الداخلية التي ترتديها الآن؟","كم من شخص قمت بالكذب عليهم في حياتك ؟","فم بتقبيل شخص في المجكوعة بإستخدام الأمر *قبلة [ منشن ]","أخبرني ما الذي يجعلك حزينًا أكثر","ما الذي تريده أكثر الآن؟","التحدث بالسوء عن صديق","أخبرني بشيء واحد فعلته يفاجئ الجميع :c","ما الذي يجعلك أسعد؟","أخبرني عن إحدى ألعابك الغبية 😏","من برأيك هي الأجمل في هذه المجموعة؟ ","ما هي المادة التي أنت الأفضل فيها؟","دعونا نؤلف قصيدة لنعترف بها للمجموعة بأكملها 💁‍♂️","استخدم طبيعة أفضل موضوع لديك للاعتراف بحبك", "ما هو الأكبر هل هو غيظ الفيل أم غيظ وحيد القرن أو غيظك أنت ؟", "ما هي لعبة الطاولة المفضلة لديك؟", "من هو اللاعب المفضل لديك ميسي أو رونالدو ؟ ", "ما هو أكبر ندمك؟", "لماذا انفصلتي أو إنفصلت عن حبيبك أو حبيبتك السابقة؟", "متى كانت آخر مرة كذبت فيها؟", "متى كانت آخر مرة بكيت فيها؟", "ما هو السر الذي لم تخبره لأحد من قبل؟", "ما هو أكبر خطأ ارتكبته على الإطلاق؟", "من تحبها بسرية؟", "ما هي شخصية الشخص الذي يعجبك؟", "هل تؤمن بالديانة البوذية؟", "هل تتبول أثناء الإستحمام؟", "هل تؤمن بوجود الأشباح ؟", "ما هو الشيء الأكثر إحراجًا الذي ضبطك والديك تفعله؟", "هل تدستيقظ في الفجر و تصلي في المسجد ؟", "من هو آخر شخص مارست معه الجنس؟", "كم كان عمرك عندما مارست العادة السرية لأول مرة؟", "ما الذي تبحث عنه عندما تشاهد أفلام هوليوود؟", "هل سبق لك أن كنت في منطقة “أصدقاء مع الفوائد” هل حدثت بالفعل?", "ارتدي ملابسك الداخلية على رأسك لمدة خمس دقائق.", "تويرك لمدة دقيقة.", "أرسل رسالة نصية مثيرة إلى الشخص رقم 20 في قائمة جهات الاتصال الخاصة بك.","قم بالخروج إلى الخارج و أصرخ بأعلى صوت لديك",]

  var random_emoji = emoji[Math.floor(Math.random() * emoji.length)];
api.sendMessage(`إليك التحدي أو الحقية من أجلك :` 
 + " ( {name} ) "
  .replace(/\{name}/g, nameUser) 
 + `: ${random_emoji}\n\n\n[ ! ] => يرجى المتابعة قبل النقر مرة أخرى !\n[ ! ] المساهمة في التحديات من خلال \'*تقرير\' أرجوك!`, event.threadID, event.messageID);
} 