module.exports.config = {
	name: "جدول_الذرات",
	version: "1.0.0",
	hasPermssion: 0,
	credits: "LeMinh",
	description: "الذرات المتقدمة",
	commandCategory: "خدمات",
	cooldowns: 0
};

module.exports.run = ({ event, api }) => api.sendMessage(`رقم جدول المجموعة الذرية المتقدمة / الاسم / التكافؤ / الحمض المقابل 1 / نترات (رقم 3) / ط / حمض النيتريك hno3 2 / هيدروكسيد (يا) / ط / لا شيء (يستخدم هذا الاسم في المركبات مع المعادن ) 3 / كربونات (co3) / ii / حمض الكربونيك h2co3 4 / فوسفات (po4) / iii / حمض الفوسفوريك h3po4 5 / كبريتات (so4) / ii / حمض الكبريتيك h2so4 6 / كبريتيت (so3) / ii / حمض الكبريتيك h2so3 7 / هيدروكربونات (hco3) / ط / حمض الكربونيك h2so4 8 / هيدروكبريتيت (hso3) / ط / حمض الكبريتيك h2so3 9 / كبريتات الهيدروجين (hso4) / ط / حمض الكبريتيك h2so4 10 / هيدروفوسفات (hpo4) / ii / حمض الفوسفوريك h3po4 11 / ثنائي هيدروفوسفات (h2po4) / ط / فوسفوريك حمض h3po4 12 / أمونيوم (nh4) / ط / بدون 13 / سيليكات (sio3) / ii / حمض السيليك h2sio3 14 / كلورات (clo3) / ط / كلوريد hclo3 15 / بيركلورات (clo4) / ط / حمض بيركلوريك hclo4 16 / كلوريت (clo2) / ط / حمض الكلوروس hclo2 17 / هيبوكلوريت (كلور) / ط / حمض هيبوكلوروس hclo 18 / برومات (bro3) / ط / حمض البروميك hbro3 19 / برمنجنات (mno4) / ط / حمضpemanganic HMnO4.`, event.threadID, event.messageID);
