module.exports.config = {
    name: "شتم",
    version: "1.0.0",
    hasPermssion: 1,
    credits: "... - Long LTD",
    description: "شتم المزعجين",
    commandCategory: "خدمات",
    usages: "شتم",
    cooldowns: 10,
    dependencies: {
        "fs-extra": "",
        "axios": ""
    }
}

module.exports.run = async function({ api, args, Users, event}) {
 var mention = Object.keys(event.mentions)[0];
    
 let name =  event.mentions[mention];
    var arraytag = [];
        arraytag.push({id: mention});
    var a = function (a) { api.sendMessage(a, event.threadID); }
a("مالك أولد القحبة كطرطى غير بوحدك بحال شي قحبة  !");
setTimeout(() => {a({body: "غنجي غادي نحويك بلا ما" })}, );
setTimeout(() => {a({body: "غتسكتنا ولاغادي نطرش دين ديماك حتا يبقى يبان ليك غير الضلام"})}, 5000);
setTimeout(() => {a({body: "راه غادي نطفي الضو ديال عينيك يا ولد المتناكة" })}, 7000);
setTimeout(() => {a({body: "يا ولد القحبة سكتنا راك صدعتينا فكرنا " })}, 9000);
setTimeout(() => {a({body: "غتسكتنا دابا ولا غنعطيك أحلى بانكاي لخويا بلوك ساخن " })}, 12000);
setTimeout(() => {a({body: "راه كلشي ساكت غير نتا كتبدا تهدر لحال الحمق غير راسك هنينا شويا 🤬🤬" })}, 15000);
setTimeout(() => {a({body: "بحال هاد ولاد القحاب مااينفعش معاهم النقاش خاثهم غير السبان هو لي يليق ليهم" })}, 17000);
setTimeout(() => {a({body: "سمع أعشيري  غادي تقاد.آه مغاديش تقاد غادي نجي  نقادك مزيان " })}, 20000);
setTimeout(() => {a({body: "خرج عندي أولد القحبة ونت مخبي مورا داك النلفون ماعرت آش كتكتب" })}, 23000);
setTimeout(() => {a({body: "والله يعطينا وجهك" })}, 25000);
setTimeout(() => {a({body: "عرفتي آش غايجي معاك مليح خرج قود " })}, 28500);
setTimeout(() => {a({body: "منعاودش نشوفك هنا طلعتي ليا فكري" })}, 31000);
setTimeout(() => {a({body: "براهش د زب" })}, 36000);
setTimeout(() => {a({body: "كضحك معاهم كيبداو يطلعو ليك فوق راسك" })}, 39000);
setTimeout(() => {a({body: "الله ينعل لي مايحشم" })}, 40000);
setTimeout(() => {a({body: "تقود مع كرك " })}, 65000);
setTimeout(() => {a({body: "خرج أصاحبي خلينا ترونكيل تبرهيش د زب" })}, 70000);
setTimeout(() => {a({body: "هاد القلاوي هادا " })}, 75000);
setTimeout(() => {a({body: "االله ينعل القحبة يماهم لي بحال هاد النوع غير كيسب" })}, 80000);
setTimeout(() => {a({body: "ولاد القحاب" })}, 85000);
setTimeout(() => {a("عاودها ل شي زامل ويبغي يسب ولا شي  حاجة راه كنشوغكم 🤬")} , 90000);
setTimeout(() => {a({body: "أما حدرتكم" })}, 95000);
setTimeout(() => {a({body: "مانبغيش نشوف زوامل بحال هاداك خونا" })}, 100000);
setTimeout(() => {a({body: " الزامللي قالها ليه" })}, 105000);
setTimeout(() => {a({body: "غيدور بيا عاوتاني و لا فالغروب غنجي عندو حتا لدارهم و غنحويه تما "})} , 115000);




  
      }