module.exports.config = {
  name: "أسماء_الله_الحسنى",
  version: "1.0.2",
  hasPermssion: 0,
  credits: "HUSSEIN",
  description: "prefix",
  usePrefix: "true",
  commandCategory: "خدمات",
  usages: "[Name module]",
  cooldowns: 1,
  envConfig: {
    autoUnsend: false,
    delayUnsend: 20
  }
};

module.exports.run = async function({ api, event }) {

  api.sendMessage(`🛑‎━━━━━━━━━━━━━━🛑
الله هـــو ۞ الله ۞ الرحمن ۞ الرحيم ۞ الملك ۞ القدوس ۞ السلام ۞ المؤمن ۞ المهيمن ۞ العزيز ۞ الجبار ۞ المتكبر ۞ الخالق ۞ البارئ ۞ المصور ۞ الغفار ۞ القهار ۞ الوهاب ۞ الرزاق ۞ الفتاح ۞ العليم ۞ القابض ۞ الباسط ۞ الخافض ۞ الرافع ۞ المعز ۞ المذل ۞ السميع ۞ البصير ۞ الحكم ۞ العدل اللطيف ۞ الخبير ۞ الحليم ۞ العظيم ۞ الغفور ۞ الشكور ۞ العلي ۞ الكبير ۞ الحفيظ ۞ المقيت ۞ الحسيب ۞ الجليل ۞ الكريم ۞ الرقيب ۞ المجيب ۞ الواسع ۞ الحكيم ۞ الودود ۞ المجيد ۞ الباعث ۞ الشهيد ۞ الحق ۞ الوكيل ۞ القوي ۞ المتين ۞ الولي ۞ الحميد ۞ المحصي ۞ المبدئ ۞ المعيد ۞ المحيي ۞ المميت ۞ الحي ۞ القيوم ۞ الواجد ۞ الماجد ۞ الواحد ۞ الأحد ۞ الصمد ۞ القادر ۞ المقتدر ۞ المقدم ۞ المؤخر ۞ الأول ۞ الآخر ۞ الظاهر ۞ الباطن ۞ الوالي المتعالي ۞ البر ۞ التواب ۞ المنتقم ۞ العفو ۞ الرءوف ۞ مالك ۞ الملك ۞ ذو ۞ الجلال ۞ والإكرام ۞ المقسط ۞ الجامع ۞ الغني ۞ المغني ۞ المانع ۞ الضار ۞ النافع ۞ النور ۞ الهادي ۞ البديع ۞ الباقي ۞ الوارث ۞ الرشيد ۞ الصبور ۞ اللهم صل وسلم وبارك علي سيد الخلق سيدنا محمد صل الله عليه وسلم إستغفرالله العظيم رب العرش العظيم واتوب اليه 🌼اللهم صل على سيدنا 🌼محمـــــــــد🌼 وعلى آل سيدنا🌼 محمـــــــــد🌼 كما صليت على سيدنا🌼 إبراهيم🌼 وعلى آل سيدنا🌼 إبراهيم🌼 في العــــــالمين إنك حميد مجيد وبارك على سيدنا🌼 محمـــــــــد🌼 وعلى آل سيدنا🌼 محمـــــــــد 🌼كما باركت على سيدنا🌼 إبراهيم 🌼وعلى آل سيدنا🌼 إبراهيم🌼 في العــــــالمين إنك حميد مجيد 🌼ربي رجوتك في هذا اليوم ان تسعد قلوب أهلي وأحبابي وأصدقائي وكل من يعـرفني وتعطيهم ما يتمنـونه وعطّر صـدرورهم بالإيـمان وارزقـهم الخلــود فـي الجــنان وانا معهم يا رحمن...يارب اجعلنا من أهل الرحمة والمغفرة ومن عتقائك من الناراللهم آمـــــين يارب العالمين.اللهم ارزقنا الجنة بغير حساب ولا سابقة عذاب
🛑━━━━━━━━━━━━━━━🛑`,
  
  event.threadID, event.messageID);
  

}
  